// 0 - пусто
// 1, 2, 3 - обычные, цифра - хп
// 10, 20, 30 - с бонусами, первая цифра - хп
// -1 - неразрушимие

public static class Levels
{
    public static readonly int[][,] Layouts = new int[][,]
    {
        // Level 1 — простой разогрев
        new int[,]
        {
            { 0, 0, 0, 0, 0, 0, 0, 0 },
            { 1, 1, 1, 1, 1, 1, 1, 1 },
            { 1, 1, 1, 1, 1, 1, 1, 1 },
            { 1, 1, 1, 1, 1, 1, 1, 1 },
            { 0, 0, 0, 0, 0, 0, 0, 0 },
        },
        // Level 2 — появляются 2-ударные, неразрушимые и пара бонусов
        new int[,]
        {
            { 0,  2, 2, 2, 2, 2, 2,  0 },
            { 1,  1,10, 1, 1,10, 1,  1 },
            { 1,  1, 1,-1,-1, 1, 1,  1 },
            { 1,  1, 1,10, 10, 1, 1,  1 },
            { 0,  1, 1, 1, 1, 1, 1,  0 },
        },
        new int[,]
        {
            {-1,  3, 3, 3, 3, 3, 3, -1 },
            { 2,  2, 2, 2, 2, 2, 2,  2 },
            { 1,  1, 1,-1,-1, 1, 1,  1 },
            { 1,  1, 1, 1, 1, 1, 1,  1 },
            { 1,  0, 1, 1, 1, 1, 0,  1 },
        },
    };

    public static int Count => Layouts.Length;
}